#Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

a = int(input("Введите номер буквы латинского алфавита"))
print(f"Ваш номер ссответсвует букве {chr(96+a)}")
